       IDENTIFICATION DIVISION.
       PROGRAM-ID. DAY01B.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT INPUT-FILE ASSIGN TO FILENAME
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
       01 INPUT-REC  PIC X(16).
       
       WORKING-STORAGE SECTION.
       77 ARGC       PIC 9(4).
       77 ARG-COUNT  PIC Z(1).
       77 PROGNAME   PIC X(256).
       77 ARG        PIC X(256) VALUE SPACES.
       77 EOF-FLAG   PIC X(1) VALUE "N".
       77 TURN-TXT   PIC X(16).
       77 TURN-LEN   PIC 9(6).
       77 TMP        PIC X(16).
       77 DELTA      PIC S9(6) VALUE 0.
       77 QUOT       PIC S9(6).
       77 REM        PIC S9(6).
       77 CROSSINGS  PIC 9(6).
       77 DIAL       PIC S9(6) VALUE 50.
       77 OLD-DIAL   PIC S9(6).
       77 OLD-DELTA  PIC S9(6).
       77 TMPVAL1    PIC S9(6).
       77 TMPVAL2    PIC S9(6).
       77 NUM-ZEROS  PIC 9(6) VALUE 0.
       77 RESULT     PIC Z(6).

       PROCEDURE DIVISION.

       ACCEPT ARGC FROM ARGUMENT-NUMBER

       DISPLAY 0 UPON ARGUMENT-NUMBER
       ACCEPT PROGNAME FROM ARGUMENT-VALUE

       EVALUATE TRUE
         WHEN ARGC IS LESS THAN 1
           DISPLAY "usage: " FUNCTION TRIM(PROGNAME) " <input file>"
           STOP RUN
       END-EVALUATE

       DISPLAY 1 UPON ARGUMENT-NUMBER
       ACCEPT ARG FROM ARGUMENT-VALUE
       MOVE FUNCTION TRIM(ARG) TO FILENAME

       OPEN INPUT INPUT-FILE
       PERFORM UNTIL EOF-FLAG = "Y"
         READ INPUT-FILE INTO INPUT-REC
           AT END
             MOVE "Y" TO EOF-FLAG
           NOT AT END
             MOVE INPUT-REC TO TURN-TXT
             PERFORM PROCESS-TURN
         END-READ
       END-PERFORM
       CLOSE INPUT-FILE

       MOVE NUM-ZEROS TO RESULT
       DISPLAY "result = " RESULT

       STOP RUN.
       
       PROCESS-TURN.
         MOVE FUNCTION LENGTH(FUNCTION TRIM(TURN-TXT)) TO TURN-LEN
         SUBTRACT 1 FROM TURN-LEN
         MOVE TURN-TXT(2:TURN-LEN) TO TMP
         MOVE FUNCTION NUMVAL(TMP) TO DELTA
         IF TURN-TXT(1:1) = "L" THEN
             COMPUTE DELTA = -1 * DELTA
         END-IF
         MOVE DIAL TO OLD-DIAL
         ADD DELTA TO DIAL
         DIVIDE 100 INTO DIAL GIVING QUOT REMAINDER REM
         IF REM < 0 THEN
           COMPUTE REM = REM + 100
         END-IF
         MOVE REM TO DIAL
        IF DELTA >= 0 THEN
          COMPUTE TMPVAL1 = OLD-DIAL + DELTA
          DIVIDE 100 INTO TMPVAL1 GIVING QUOT
          MOVE QUOT TO TMPVAL1
          DIVIDE 100 INTO OLD-DIAL GIVING QUOT
          COMPUTE CROSSINGS = TMPVAL1 - QUOT
        ELSE
          COMPUTE OLD-DELTA = -1 * DELTA
          IF OLD-DIAL = 0 THEN
            DIVIDE 100 INTO OLD-DELTA GIVING CROSSINGS
          ELSE
            IF OLD-DELTA >= OLD-DIAL THEN
              COMPUTE TMPVAL1 = OLD-DELTA - OLD-DIAL
              DIVIDE 100 INTO TMPVAL1 GIVING CROSSINGS
              ADD 1 TO CROSSINGS
            ELSE
              MOVE 0 TO CROSSINGS
            END-IF
          END-IF
        END-IF
        ADD CROSSINGS TO NUM-ZEROS.
