       IDENTIFICATION DIVISION.
       PROGRAM-ID. DAY01A.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT INPUT-FILE ASSIGN TO FILENAME
           ORGANIZATION IS SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
       01 CONTENTS   PIC X(16384).
       
       WORKING-STORAGE SECTION.
       77 ARGC       PIC 9(4).
       77 ARG-COUNT  PIC Z(1).
       77 PROGNAME   PIC X(256).
       77 ARG        PIC X(256) VALUE SPACES.
       77 EOF-FLAG   PIC X(1) VALUE "N".
       77 FLOOR      PIC S9(4) VALUE 0.
       77 I          PIC 9(6).
       77 RESULT     PIC Z(4).

       PROCEDURE DIVISION.

       ACCEPT ARGC FROM ARGUMENT-NUMBER

       DISPLAY 0 UPON ARGUMENT-NUMBER
       ACCEPT PROGNAME FROM ARGUMENT-VALUE

       EVALUATE TRUE
         WHEN ARGC IS LESS THAN 1
           DISPLAY "usage: " FUNCTION TRIM(PROGNAME) " <input file>"
           STOP RUN
       END-EVALUATE

       DISPLAY 1 UPON ARGUMENT-NUMBER
       ACCEPT ARG FROM ARGUMENT-VALUE
       MOVE FUNCTION TRIM(ARG) TO FILENAME

       OPEN INPUT INPUT-FILE
       PERFORM UNTIL EOF-FLAG = "Y"
         READ INPUT-FILE INTO CONTENTS
           AT END
             MOVE "Y" TO EOF-FLAG
         END-READ
       END-PERFORM
       CLOSE INPUT-FILE
       PERFORM PROCESS-CONTENTS

       MOVE FLOOR TO RESULT
       DISPLAY "result = " RESULT

       STOP RUN.
       
       PROCESS-CONTENTS.
         PERFORM VARYING I FROM 1 BY 1 UNTIL I > LENGTH OF CONTENTS
           EVALUATE TRUE
             WHEN CONTENTS(I:1) = "("
               ADD 1 TO FLOOR
             WHEN CONTENTS(I:1) = ")"
               SUBTRACT 1 FROM FLOOR
           END-EVALUATE
         END-PERFORM.
